
// Ітерація по масиву
// Ітерація (перебір) по масиву означає послідовний доступ до кожного елемента масиву для виконання певних операцій.
// У JavaScript існують різні способи ітерації, які дозволяють здійснювати різні дії з елементами масиву

//                          Цикл - for :
// Цей цикл є класичним способом ітерації. Ви можете використовувати цикл
// for для перебору всіх елементів масиву за допомогою індексів.

// const fruits = ["apple", "pineapple", "banana"]
// for (let i = 0; i < fruits.length; i++) {
//     const item = fruits[i]
//     console.log(`Index ${i}, value: ${item}`)
// }
// Poverne:
// Index 0, value: apple
// Index 1, value: pineapple
// Index 2, value: banana

// --------------------------------

//                      Цикл for...of :
// Цикл for...of є зручним способом для ітерації (перебору) елементів масиву у сучасному JavaScript.
// Він дозволяє безпосередньо перебирати значення елементів масиву без необхідності вказувати індекси.

//  ------------ Suntaksis:

// for (const елемент of масив) {
//     // Код, що виконується на кожній ітерації
// }
// -- елемент : Змінна, в яку буде записуватися поточний елемент масиву під час ітерації.
// -- масив : Масив, який ми хочемо перебрати.
// ---------------
//////////////////////////
// const fruits = ["apple", "pineapple", "banana"]
// for (const fruit of fruits){
//     console.log(fruit)
// }
// Poverne:
// apple
// pineapple
// banana
////////////////////////////
// -----------------------------


