//const num1 = 1
// const num2 = 2
//
// const sum = num1 + num2 + 10 // sum - operator, num1, num2, 10 - operant

//console.log(40 + 2); // 42 - операція додавання
// console.log(42 - 2); // 40 - операція віднімання
// console.log(2 * 2); // 4 - операція множення
// console.log(4 / 2); // 2 - операція ділення

//Ділення за модулем (залишок від ділення). //
// Оператор залишок % , попри свій
// зовнішній вигляд, не пов’язаний із відсотками. Результатом a % b є залишок
// цілочислового ділення a на b .
// console.log( 5 % 2 ); // 1 — залишок від ділення 5 на 2
// console.log( 2 % 2 ); // 0 — залишок від ділення 2 на 2

//Інкремент ++ збільшує змінну на 1
//Декремент -- зменшує змінну на 1
//let num = 7
// num++ //num = num + 1
// console.log(num)
// num-- // num = num - 1
// console.log(num)


//Оператори порівняння. Повертає true or false
// У JavaScript є наступні оператори порівняння:
// Більше / більше або дорівнює: a > b , a >= b
// Менше / менше або дорівнює: a < b , a <= b
// Дорівнює: a == b
// Не дорівнює: a != b
// Строго дорівнює: a === b
// Строго не дорівнює: a !== b

//console.log(3 > 1)
// console.log(2 != 1)
// console.log("Hello" === "Hello") // true
// console.log("Hello" === "Hello!") //false
// console.log("1" != 1)


